{"id": "B005SYZZ7Q", "title": "Amazon.com: Get Carter (1971) : Michael Caine, Ian Hendry, John Osborne, Britt Ekland, Mike Hodges: Movies & TV", "comment": [{"reviewerId": "R3PY8JR5NED1FT", "reviewerName": "Nosidino", "overall": "4.0", "reviewTime": "October 2, 2019", "reviewText": "\n  A solid Michael Caine film but I found it hard to follow some of the plot. For instance, the two criminals sent to get Caine in the film were from London, not Newcastle. I thought they had been sent by the crime boss he had gone to see the previous day (Poker Game). As I said, this is a great role played perfectly by Michael Caine.This is from Leonard Maltin's 2009 Review. Austere, brutal crime drama about a cheerless hitman who goes to Newcastle to investigate his brother's death. Caine perfectly embodies his amoral character, and the film's violence still packs a wallop. Based on a novel by Ted Lewis, adapted by Hodges.I would not call Carter amoral but immoral. He slays two women in this film (One Inadvertently) but he abuses them all nonetheless. He's a brutal man and by the end of the film we are indifferent to his fate. But karma catches up to everyone in the end.I'm the 185th person to review this Four Star DVD. You may or may not want to buy it, however. The scenes of violence will shock most women and a few men, too. Britt Ekland is gorgeous in this film. But her fate is a tragic one.A. Nathaniel Wallace, Jr.\n", "summary": "A Solid Film With A Fantastic Performance", "helpfulness": "5 people found this helpful"}, {"reviewerId": "R2IJJCRO2TE5LY", "reviewerName": "g", "overall": "4.0", "reviewTime": "June 16, 2017", "reviewText": "\n  VERY GOOD BRITISH GANGSTER REVENGE STORY.  Micahel Caine Is perfect in his role as the gangster brother of a murdered man who sets out to find out the real reason why his brother was murdered.  The plot has been well presented by other reviewers already so I'll just give it my nod.  Of course it's dependent on several things.  #1  you liking Michael Caine as an actor.  #2 That you're into  films placed in the 60's / 70\"s era.  #3 You like things British & gangster & can deal with violence though not gratuitous.  I give it 4 stars (which equates to an 8) as let's face it few films are 10's.  If you want the original non dubbed version than get the dvd.  Price & service were very good.\n", "summary": "GET CARTER  - ORIGINAL NON DUBBED  DVD", "helpfulness": "12 people found this helpful"}], "style": "\n             "}
